# Pandas

- Python Data Analysis library
- Built on top of Numpy
- Name has been derived from Panel Data System
    -      An econometrics term for data sets that include observations over multiple time periods for the same individuals

## Why it is used by data scientists

- Munging Data 
    - Converting data from one form to another to make it easier to analyse
- Cleaning Data
    - Detecting and eradicating corrupt or inaccurate records including missing fields
- Analyzing
    - Easy to perform calculations and gain insights
- Modelling Data
    - Easy to define data requirements to answer business questions

## Importing Pandas

In [1]:
import pandas as pd

## Series

- A `Series` is a one-dimensional object similar to an array, list, or column in a table. 
- It will assign a labeled index to each item in the Series.

In [2]:
s = pd.Series(['Apple', 'Banana', 43, 65.6, 'Final'])
s

0     Apple
1    Banana
2        43
3      65.6
4     Final
dtype: object

In [49]:
s = pd.Series(['Apple', 'Banana', 'Guava', 'Tomato', 'Potato'], index=['1', '2', '3', '4', '5'])
s

1     Apple
2    Banana
3     Guava
4    Tomato
5    Potato
dtype: object

The `Series` constructor can convert a dictonary as well, using the keys of the dictionary as its index.

In [3]:
dictionary = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(dictionary)
cities

Austin            450.0
Boston              NaN
Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
dtype: float64

You can use the index to select specific items from the Series ...

In [4]:
cities['Chicago']

1000.0

In [5]:
#Use multiple items
cities[['Chicago', 'Portland', 'San Francisco']]

Chicago          1000.0
Portland          900.0
San Francisco    1100.0
dtype: float64

Or you can use boolean indexing for selection.

In [6]:
cities[cities < 1000]

Austin      450.0
Portland    900.0
dtype: float64

You can also change the values in a Series on the fly.

In [7]:
# changing based on the index
print('Old value:', cities['Chicago'])
cities['Chicago'] = 1400
print('New value:', cities['Chicago'])

Old value: 1000.0
New value: 1400.0

What if you aren't sure whether an item is in the Series? You can check using idiomatic Python.

In [8]:
print('Seattle' in cities)
print('San Francisco' in cities)

False
True

## DataFrames

A `DataFrame` (Table) is a 2-dimensional tabular data structure made up of a few components

* index - Think of it like column that contains the id for the row. In this data set, there is no index
* column

In [50]:
#DataFrame({
#           col1: {row1: value11, row2: value12},
#           col2: {row2: value21, row2: value22}
#          })
df = pd.DataFrame({
        'A': {0: 'a', 1: 'b', 2: 'c'},
        'B': {0: 1, 1: 3, 2: 5},
        'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

## Descriptive statistics

Also: count, sum, median, min, max, abs, prod, std, var, skew, kurt, quantile, cumsum, cumprod, cummax, cummin

In [51]:
df.mean()

B    3.0
C    4.0
dtype: float64

## Indexes

In [10]:
df.index.tolist()

[0, 1, 2]

## Importing Data

You can easily import data from an excel file to a jupyter notebook using `read_excel`

In [11]:
df = pd.read_excel('C:/Users/smart/OneDrive - Singapore Management University/SMU/BIA/Curriculum/Workshop-Github/PythonWorkshop/resources/enrollment.xlsx')

#Print the top 5 rows using df.head(5)
df.head(5)

,year,school,course_type,course_name,gender,no_of_students
0,2017,School of Business & Accountancy,Full-time,Diploma in Accountancy,Female,468
1,2017,School of Business & Accountancy,Full-time,Diploma in Accountancy,Male,404
2,2017,School of Business & Accountancy,Full-time,Diploma in Banking & Financial Services,Female,126
3,2017,School of Business & Accountancy,Full-time,Diploma in Banking & Financial Services,Male,180
4,2017,School of Business & Accountancy,Full-time,Diploma in Business Information Technology,Female,68

With `read_table`, you can also create Dataframes using URLs

In [12]:
url = 'https://raw.github.com/gjreda/best-sandwiches/master/data/best-sandwiches-geocode.tsv'

# fetch the text from the URL and read it into a DataFrame
df_url = pd.read_table(url, sep='\t')
df_url.head(3)

,rank,sandwich,restaurant,description,price,address,city,phone,website,full_address,formatted_address,lat,lng
0,1,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10,2109 W. Chicago Ave.,Chicago,773-772-0406,theoldoaktap.com,"2109 W. Chicago Ave., Chicago","2109 West Chicago Avenue, Chicago, IL 60622, USA",41.895734,-87.679960
1,2,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9,800 W. Randolph St.,Chicago,312-929-4580,aucheval.tumblr.com,"800 W. Randolph St., Chicago","800 West Randolph Street, Chicago, IL 60607, USA",41.884672,-87.647754
2,3,Woodland Mushroom,Xoco,Leave it to Rick Bayless and crew to come up w...,$9.50.,445 N. Clark St.,Chicago,312-334-3688,rickbayless.com,"445 N. Clark St., Chicago","445 North Clark Street, Chicago, IL 60654, USA",41.890602,-87.630925

## Common Operations on DataFrames

** Accessing a table **

In [13]:
# table_variable['column_name']

df['year'].head(5)

0    2017
1    2017
2    2017
3    2017
4    2017
Name: year, dtype: int64

**Modifying a Column**

In this example, we are setting the `no_of_students` to a fixed value of 5

In [14]:
new_df= df.copy()

new_df['no_of_students'] = 5

new_df.head(5)

,year,school,course_type,course_name,gender,no_of_students
0,2017,School of Business & Accountancy,Full-time,Diploma in Accountancy,Female,5
1,2017,School of Business & Accountancy,Full-time,Diploma in Accountancy,Male,5
2,2017,School of Business & Accountancy,Full-time,Diploma in Banking & Financial Services,Female,5
3,2017,School of Business & Accountancy,Full-time,Diploma in Banking & Financial Services,Male,5
4,2017,School of Business & Accountancy,Full-time,Diploma in Business Information Technology,Female,5

We can use existing columns. Like in excel where you have a formula for cell `C1` as

```
= A1 + B1
```

In pandas you would have

```
df['C'] = df['A'] + df['B']
```

Where the formula applies to the entire column

In [15]:
new_df = df.copy()

# In this example, you are adding 1 to the existing no_of_students column

new_df['no_of_students'] = new_df['no_of_students'] + 1

new_df.head(5)

,year,school,course_type,course_name,gender,no_of_students
0,2017,School of Business & Accountancy,Full-time,Diploma in Accountancy,Female,469
1,2017,School of Business & Accountancy,Full-time,Diploma in Accountancy,Male,405
2,2017,School of Business & Accountancy,Full-time,Diploma in Banking & Financial Services,Female,127
3,2017,School of Business & Accountancy,Full-time,Diploma in Banking & Financial Services,Male,181
4,2017,School of Business & Accountancy,Full-time,Diploma in Business Information Technology,Female,69

** Using .pivot() **

Reshape data (produce a “pivot” table) based on column values. Uses unique values from index / columns to form axes of the resulting DataFrame.

In [16]:
df_pivot = pd.DataFrame({'gender': ['girl','girl','girl','guy','guy','guy'],
                       'class': ['A', 'B', 'C', 'A', 'B', 'C'],
                       'age': [10, 12, 13, 14, 15, 16],
                      'test_score': [7,6,4,3,2,1]})
df_pivot

   age class gender  test_score
0   10     A   girl           7
1   12     B   girl           6
2   13     C   girl           4
3   14     A    guy           3
4   15     B    guy           2
5   16     C    guy           1

In [17]:
df_pivot.pivot(index='gender', columns='class')['test_score']

class   A  B  C
gender
girl    7  6  4
guy     3  2  1

** .merge() **

In [18]:
import numpy as np

#imported numpy just to use np.Nan feature below
df_1 = pd.DataFrame({'gender': ['girl','girl',np.NaN,'guy','guy','guy'],
                       'class': ['A', 'B', 'C', 'A', 'B', 'C'],
                       'age': [10, 12, 13, 14, 15, 16],
                      'test_score': [7,6,4,3,2,1]})
df_1

   age class gender  test_score
0   10     A   girl           7
1   12     B   girl           6
2   13     C    NaN           4
3   14     A    guy           3
4   15     B    guy           2
5   16     C    guy           1

In [19]:
df_2 = pd.DataFrame({'gender': ['girl','guy'],
                       'hair_length': [ 'long', 'short']})
df_2

  gender hair_length
0   girl        long
1    guy       short

<img src="resources/merge-image.jpg"/>

** Outer join **

In [20]:
df_1.merge(df_2, on='gender', how='outer')

   age class gender  test_score hair_length
0   10     A   girl           7        long
1   12     B   girl           6        long
2   13     C    NaN           4         NaN
3   14     A    guy           3       short
4   15     B    guy           2       short
5   16     C    guy           1       short

** Inner join **

In [21]:
df_1.merge(df_2, on='gender', how='inner')

   age class gender  test_score hair_length
0   10     A   girl           7        long
1   12     B   girl           6        long
2   14     A    guy           3       short
3   15     B    guy           2       short
4   16     C    guy           1       short

** Left join **

In [22]:
df_1.merge(df_2, on='gender', how='left')

   age class gender  test_score hair_length
0   10     A   girl           7        long
1   12     B   girl           6        long
2   13     C    NaN           4         NaN
3   14     A    guy           3       short
4   15     B    guy           2       short
5   16     C    guy           1       short

** Right join **

In [23]:
df_1.merge(df_2, on='gender', how='right')

   age class gender  test_score hair_length
0   10     A   girl           7        long
1   12     B   girl           6        long
2   14     A    guy           3       short
3   15     B    guy           2       short
4   16     C    guy           1       short

## df.info()

Gives me details about the number of rows, the data types, and is useful to see if there are missing values

In [35]:
df.head()

,year,school,course_type,gender,no_of_students
course_name,,,,,
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Female,468
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Male,404
Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Female,126
Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Male,180
Diploma in Business Information Technology,2017,School of Business & Accountancy,Full-time,Female,68

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 166 entries, 0 to 165
Data columns (total 6 columns):
year              166 non-null int64
school            166 non-null object
course_type       166 non-null object
course_name       166 non-null object
gender            166 non-null object
no_of_students    166 non-null int64
dtypes: int64(2), object(4)
memory usage: 7.9+ KB

## df.describe()

Gives details about the *numeric* variables

In [26]:
df.describe()

         year  no_of_students
count   166.0      166.000000
mean   2017.0      100.301205
std       0.0      148.295139
min    2017.0        1.000000
25%    2017.0       16.750000
50%    2017.0       54.000000
75%    2017.0      111.500000
max    2017.0     1236.000000

## df.set_index() and df.reset_index()

In [27]:
#Use the `inplace` parameter to change the dataframe and store it in itself
#instead of creating a new DF
df.set_index('course_name', inplace=True)
df.head()

,year,school,course_type,gender,no_of_students
course_name,,,,,
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Female,468
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Male,404
Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Female,126
Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Male,180
Diploma in Business Information Technology,2017,School of Business & Accountancy,Full-time,Female,68

In [28]:
df.reset_index(inplace=True)
df.head()

,course_name,year,school,course_type,gender,no_of_students
0,Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Female,468
1,Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Male,404
2,Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Female,126
3,Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Male,180
4,Diploma in Business Information Technology,2017,School of Business & Accountancy,Full-time,Female,68

# Locating rows in Pandas Dataframe

## df.iloc[]

We can select the rows by position if we use df.iloc()
For example, df.iloc([2,3,4]) will return the 2nd, 3rd, and 4th rows

In [29]:
df.iloc[[1,2,3]]

,course_name,year,school,course_type,gender,no_of_students
1,Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Male,404
2,Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Female,126
3,Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Male,180

## df.loc[]

We can select the rows by `label` if we use df.loc() For example, df.loc([2,3,4]) will return the rows with index=2,3,4

In [30]:
df.set_index('course_name', inplace=True)

In [31]:
df.head()

,year,school,course_type,gender,no_of_students
course_name,,,,,
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Female,468
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Male,404
Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Female,126
Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Male,180
Diploma in Business Information Technology,2017,School of Business & Accountancy,Full-time,Female,68

In [32]:
#Returns the rows with index = Diploma in Accountancy
df.loc['Diploma in Accountancy']

,year,school,course_type,gender,no_of_students
course_name,,,,,
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Female,468
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Male,404

In [33]:
#Returns columns course_type, gender of rows with index = Diploma in Accountancy
df.loc[['Diploma in Accountancy'], ['course_type', 'gender']]

                       course_type  gender
course_name
Diploma in Accountancy   Full-time  Female
Diploma in Accountancy   Full-time    Male

In [34]:
#returns all rows with gender = male
df.loc[df['gender']=='Male'].head()

,year,school,course_type,gender,no_of_students
course_name,,,,,
Diploma in Accountancy,2017,School of Business & Accountancy,Full-time,Male,404
Diploma in Banking & Financial Services,2017,School of Business & Accountancy,Full-time,Male,180
Diploma in Business Information Technology,2017,School of Business & Accountancy,Full-time,Male,106
Diploma in Business Studies,2017,School of Business & Accountancy,Full-time,Male,403
Diploma in International Business,2017,School of Business & Accountancy,Full-time,Male,61

# Saving a Dataframe

## Saving to a csv file

In [37]:
df.to_csv('updated_csv.csv', encoding='utf-8')

## Saving to an Excel Workbook

In [39]:
from pandas import ExcelWriter
writer = ExcelWriter('updated_xlsx.xlsx')
df.to_excel(writer, 'Sheet1')
df_1.to_excel(writer, 'Sheet2')
writer.save()

## Saving to a Python dictionary

In [42]:
dictionary = df.to_dict()
dictionary

{'course_type': {'Accounting & Finance': 'Part-time diploma',
  'Advanced Diploma in Accountancy': 'Part-time advanced diploma',
  'Advanced Diploma in Early Childhood Intervention (Special Needs)': 'Part-time advanced diploma',
  'Advanced Diploma in Early Childhood Leadership': 'Part-time advanced diploma',
  'Advanced Diploma in Enterprise Business Analytics': 'Part-time advanced diploma',
  'Advanced Diploma in Medical and Pharmaceutical Technology': 'Part-time advanced diploma',
  'Advanced Diploma in Perioperative Nursing': 'Part-time advanced diploma',
  'Constructing a Meaningful Educational Setting': 'Part-time skills-based module',
  'Data Design & Analytics': 'Part-time skills-based module',
  'Diploma (Conversion) in Digital Media Design': 'Part-time diploma conversion',
  'Diploma (Conversion) in Facility Management': 'Part-time diploma conversion',
  'Diploma (Conversion) in Marine & Offshore Technology': 'Part-time diploma conversion',
  'Diploma in Accountancy': 'Full-time',
  'Diploma in Advertising & Public Relations': 'Full-time',
  'Diploma in Aerospace Electronics': 'Full-time',
  'Diploma in Aerospace Technology': 'Full-time',
  'Diploma in Animation & 3D Arts': 'Full-time',
  'Diploma in Arts Business Management': 'Full-time',
  'Diploma in Audio-visual Technology': 'Full-time',
  'Diploma in Automation & Mechatronic Systems': 'Full-time',
  'Diploma in Banking & Financial Services': 'Full-time',
  'Diploma in Biomedical Engineering': 'Full-time',
  'Diploma in Biomedical Science': 'Full-time',
  'Diploma in Business & Social Enterprise': 'Full-time',
  'Diploma in Business Information Technology': 'Full-time',
  'Diploma in Business Practice (Administration & Management)': 'Part-time diploma',
  'Diploma in Business Practice (International Supply Chain Management)': 'Part-time diploma',
  'Diploma in Business Practice (Tourism Management)': 'Part-time diploma',
  'Diploma in Business Studies': 'Full-time',
  'Diploma in Chemical & Biomolecular Engineering': 'Full-time',
  'Diploma in Child Psychology & Early Education': 'Full-time',
  'Diploma in Chinese Media & Communication': 'Full-time',
  'Diploma in Chinese Studies': 'Full-time',
  'Diploma in Clean Energy Management': 'Full-time',
  'Diploma in Early Childhood Care & Education - Teaching': 'Part-time diploma',
  'Diploma in Early Childhood Education': 'Full-time',
  'Diploma in Electrical Engineering': 'Full-time',
  'Diploma in Electronic & Computer Engineering': 'Full-time',
  'Diploma in Engineering (Aerospace)': 'Part-time diploma',
  'Diploma in Engineering (Building Services & Fire Safety)': 'Part-time diploma',
  'Diploma in Engineering (Electrical)': 'Part-time diploma',
  'Diploma in Engineering (Electronics)': 'Part-time diploma',
  'Diploma in Engineering (Marine)': 'Part-time diploma',
  'Diploma in Engineering (Mechanical)': 'Part-time diploma',
  'Diploma in Engineering (Mechatronics)': 'Part-time diploma',
  'Diploma in Engineering Science': 'Full-time',
  'Diploma in Engineering with Business Management Programme': 'Full-time',
  'Diploma in Environmental & Water Technology': 'Full-time',
  'Diploma in Film, Sound & Video': 'Full-time',
  'Diploma in Financial Informatics': 'Full-time',
  'Diploma in Health Sciences (Nursing)': 'Full-time',
  'Diploma in Hotel & Leisure Facilities Management': 'Full-time',
  'Diploma in Information Security & Forensics': 'Full-time',
  'Diploma in Information Technology': 'Full-time',
  'Diploma in International Business': 'Full-time',
  'Diploma in International Logistics & Supply Chain Management': 'Full-time',
  'Diploma in Landscape Design & Horticulture': 'Full-time',
  'Diploma in Marine & Offshore Technology': 'Full-time',
  'Diploma in Mass Communication': 'Full-time',
  'Diploma in Mechanical Engineering': 'Full-time',
  'Diploma in Molecular Biotechnology': 'Full-time',
  'Diploma in Multimedia & Animation': 'Full-time',
  'Diploma in Network Systems & Security': 'Full-time',
  'Diploma in Optometry': 'Full-time',
  'Diploma in Pharmacy Science': 'Full-time',
  'Diploma in Product Design & Innovation': 'Full-time',
  'Diploma in Psychology Studies': 'Full-time',
  'Diploma in Real Estate Business': 'Full-time',
  'Diploma in Sustainable Urban Design & Engineering': 'Full-time',
  'Diploma in Tamil Studies with Early Education': 'Full-time',
  'Diploma in Tourism & Resort Management': 'Full-time',
  'Diploma in Veterinary Bioscience': 'Full-time',
  'Diploma in Visual Effects': 'Full-time',
  'Downstream processing': 'Part-time skills-based module',
  'Fundamental of Offshore Oil & Gas Technology': 'Part-time skills-based module',
  'Industrial Drive Systems': 'Part-time skills-based module',
  'Power Hydraulics': 'Part-time skills-based module',
  'Principles of Marketing': 'Part-time diploma',
  'Professional Roles in Educational Support': 'Part-time skills-based module',
  'Specialist Diploma in Analytical Science': 'Part-time specialist diploma',
  'Specialist Diploma in Consumer & Performance Analytics': 'Part-time specialist diploma',
  'Specialist Diploma in Consumer Banking': 'Part-time specialist diploma',
  'Specialist Diploma in Digital Branding & Social Media Strategies': 'Part-time specialist diploma',
  'Specialist Diploma in Early Childhood Learning Support': 'Part-time specialist diploma',
  'Specialist Diploma in Electrical Design & Operation': 'Part-time specialist diploma',
  'Specialist Diploma in IT Network Systems': 'Part-time specialist diploma',
  'Specialist Diploma in Palliative Care Nursing': 'Part-time specialist diploma',
  'Specialist Diploma in Sustainable Facilities Management': 'Part-time specialist diploma',
  'Specialist Diploma in Veterinary Clinical Practice': 'Part-time specialist diploma',
  'Upstream processing': 'Part-time skills-based module'},
 'gender': {'Accounting & Finance': 'Male',
  'Advanced Diploma in Accountancy': 'Female',
  'Advanced Diploma in Early Childhood Intervention (Special Needs)': 'Female',
  'Advanced Diploma in Early Childhood Leadership': 'Female',
  'Advanced Diploma in Enterprise Business Analytics': 'Female',
  'Advanced Diploma in Medical and Pharmaceutical Technology': 'Female',
  'Advanced Diploma in Perioperative Nursing': 'Female',
  'Constructing a Meaningful Educational Setting': 'Female',
  'Data Design & Analytics': 'Female',
  'Diploma (Conversion) in Digital Media Design': 'Female',
  'Diploma (Conversion) in Facility Management': 'Female',
  'Diploma (Conversion) in Marine & Offshore Technology': 'Male',
  'Diploma in Accountancy': 'Male',
  'Diploma in Advertising & Public Relations': 'Male',
  'Diploma in Aerospace Electronics': 'Male',
  'Diploma in Aerospace Technology': 'Male',
  'Diploma in Animation & 3D Arts': 'Male',
  'Diploma in Arts Business Management': 'Male',
  'Diploma in Audio-visual Technology': 'Male',
  'Diploma in Automation & Mechatronic Systems': 'Male',
  'Diploma in Banking & Financial Services': 'Male',
  'Diploma in Biomedical Engineering': 'Male',
  'Diploma in Biomedical Science': 'Male',
  'Diploma in Business & Social Enterprise': 'Male',
  'Diploma in Business Information Technology': 'Male',
  'Diploma in Business Practice (Administration & Management)': 'Female',
  'Diploma in Business Practice (International Supply Chain Management)': 'Female',
  'Diploma in Business Practice (Tourism Management)': 'Female',
  'Diploma in Business Studies': 'Male',
  'Diploma in Chemical & Biomolecular Engineering': 'Male',
  'Diploma in Child Psychology & Early Education': 'Male',
  'Diploma in Chinese Media & Communication': 'Male',
  'Diploma in Chinese Studies': 'Male',
  'Diploma in Clean Energy Management': 'Male',
  'Diploma in Early Childhood Care & Education - Teaching': 'Female',
  'Diploma in Early Childhood Education': 'Male',
  'Diploma in Electrical Engineering': 'Male',
  'Diploma in Electronic & Computer Engineering': 'Male',
  'Diploma in Engineering (Aerospace)': 'Female',
  'Diploma in Engineering (Building Services & Fire Safety)': 'Female',
  'Diploma in Engineering (Electrical)': 'Female',
  'Diploma in Engineering (Electronics)': 'Female',
  'Diploma in Engineering (Marine)': 'Female',
  'Diploma in Engineering (Mechanical)': 'Female',
  'Diploma in Engineering (Mechatronics)': 'Female',
  'Diploma in Engineering Science': 'Male',
  'Diploma in Engineering with Business Management Programme': 'Male',
  'Diploma in Environmental & Water Technology': 'Male',
  'Diploma in Film, Sound & Video': 'Male',
  'Diploma in Financial Informatics': 'Male',
  'Diploma in Health Sciences (Nursing)': 'Male',
  'Diploma in Hotel & Leisure Facilities Management': 'Male',
  'Diploma in Information Security & Forensics': 'Male',
  'Diploma in Information Technology': 'Male',
  'Diploma in International Business': 'Male',
  'Diploma in International Logistics & Supply Chain Management': 'Male',
  'Diploma in Landscape Design & Horticulture': 'Male',
  'Diploma in Marine & Offshore Technology': 'Male',
  'Diploma in Mass Communication': 'Male',
  'Diploma in Mechanical Engineering': 'Male',
  'Diploma in Molecular Biotechnology': 'Male',
  'Diploma in Multimedia & Animation': 'Male',
  'Diploma in Network Systems & Security': 'Male',
  'Diploma in Optometry': 'Male',
  'Diploma in Pharmacy Science': 'Male',
  'Diploma in Product Design & Innovation': 'Male',
  'Diploma in Psychology Studies': 'Male',
  'Diploma in Real Estate Business': 'Male',
  'Diploma in Sustainable Urban Design & Engineering': 'Male',
  'Diploma in Tamil Studies with Early Education': 'Male',
  'Diploma in Tourism & Resort Management': 'Male',
  'Diploma in Veterinary Bioscience': 'Male',
  'Diploma in Visual Effects': 'Male',
  'Downstream processing': 'Male',
  'Fundamental of Offshore Oil & Gas Technology': 'Male',
  'Industrial Drive Systems': 'Male',
  'Power Hydraulics': 'Male',
  'Principles of Marketing': 'Female',
  'Professional Roles in Educational Support': 'Female',
  'Specialist Diploma in Analytical Science': 'Female',
  'Specialist Diploma in Consumer & Performance Analytics': 'Female',
  'Specialist Diploma in Consumer Banking': 'Male',
  'Specialist Diploma in Digital Branding & Social Media Strategies': 'Female',
  'Specialist Diploma in Early Childhood Learning Support': 'Female',
  'Specialist Diploma in Electrical Design & Operation': 'Female',
  'Specialist Diploma in IT Network Systems': 'Male',
  'Specialist Diploma in Palliative Care Nursing': 'Female',
  'Specialist Diploma in Sustainable Facilities Management': 'Female',
  'Specialist Diploma in Veterinary Clinical Practice': 'Female',
  'Upstream processing': 'Female'},
 'no_of_students': {'Accounting & Finance': 1,
  'Advanced Diploma in Accountancy': 51,
  'Advanced Diploma in Early Childhood Intervention (Special Needs)': 100,
  'Advanced Diploma in Early Childhood Leadership': 85,
  'Advanced Diploma in Enterprise Business Analytics': 43,
  'Advanced Diploma in Medical and Pharmaceutical Technology': 21,
  'Advanced Diploma in Perioperative Nursing': 12,
  'Constructing a Meaningful Educational Setting': 12,
  'Data Design & Analytics': 1,
  'Diploma (Conversion) in Digital Media Design': 14,
  'Diploma (Conversion) in Facility Management': 5,
  'Diploma (Conversion) in Marine & Offshore Technology': 12,
  'Diploma in Accountancy': 404,
  'Diploma in Advertising & Public Relations': 26,
  'Diploma in Aerospace Electronics': 224,
  'Diploma in Aerospace Technology': 386,
  'Diploma in Animation & 3D Arts': 30,
  'Diploma in Arts Business Management': 16,
  'Diploma in Audio-visual Technology': 80,
  'Diploma in Automation & Mechatronic Systems': 295,
  'Diploma in Banking & Financial Services': 180,
  'Diploma in Biomedical Engineering': 146,
  'Diploma in Biomedical Science': 112,
  'Diploma in Business & Social Enterprise': 41,
  'Diploma in Business Information Technology': 106,
  'Diploma in Business Practice (Administration & Management)': 206,
  'Diploma in Business Practice (International Supply Chain Management)': 36,
  'Diploma in Business Practice (Tourism Management)': 4,
  'Diploma in Business Studies': 403,
  'Diploma in Chemical & Biomolecular Engineering': 218,
  'Diploma in Child Psychology & Early Education': 54,
  'Diploma in Chinese Media & Communication': 23,
  'Diploma in Chinese Studies': 21,
  'Diploma in Clean Energy Management': 82,
  'Diploma in Early Childhood Care & Education - Teaching': 155,
  'Diploma in Early Childhood Education': 36,
  'Diploma in Electrical Engineering': 481,
  'Diploma in Electronic & Computer Engineering': 539,
  'Diploma in Engineering (Aerospace)': 5,
  'Diploma in Engineering (Building Services & Fire Safety)': 11,
  'Diploma in Engineering (Electrical)': 11,
  'Diploma in Engineering (Electronics)': 49,
  'Diploma in Engineering (Marine)': 11,
  'Diploma in Engineering (Mechanical)': 4,
  'Diploma in Engineering (Mechatronics)': 4,
  'Diploma in Engineering Science': 154,
  'Diploma in Engineering with Business Management Programme': 106,
  'Diploma in Environmental & Water Technology': 67,
  'Diploma in Film, Sound & Video': 104,
  'Diploma in Financial Informatics': 165,
  'Diploma in Health Sciences (Nursing)': 279,
  'Diploma in Hotel & Leisure Facilities Management': 93,
  'Diploma in Information Security & Forensics': 110,
  'Diploma in Information Technology': 317,
  'Diploma in International Business': 61,
  'Diploma in International Logistics & Supply Chain Management': 158,
  'Diploma in Landscape Design & Horticulture': 45,
  'Diploma in Marine & Offshore Technology': 301,
  'Diploma in Mass Communication': 113,
  'Diploma in Mechanical Engineering': 546,
  'Diploma in Molecular Biotechnology': 46,
  'Diploma in Multimedia & Animation': 77,
  'Diploma in Network Systems & Security': 117,
  'Diploma in Optometry': 38,
  'Diploma in Pharmacy Science': 38,
  'Diploma in Product Design & Innovation': 75,
  'Diploma in Psychology Studies': 50,
  'Diploma in Real Estate Business': 118,
  'Diploma in Sustainable Urban Design & Engineering': 87,
  'Diploma in Tamil Studies with Early Education': 2,
  'Diploma in Tourism & Resort Management': 56,
  'Diploma in Veterinary Bioscience': 23,
  'Diploma in Visual Effects': 46,
  'Downstream processing': 3,
  'Fundamental of Offshore Oil & Gas Technology': 3,
  'Industrial Drive Systems': 4,
  'Power Hydraulics': 4,
  'Principles of Marketing': 1,
  'Professional Roles in Educational Support': 5,
  'Specialist Diploma in Analytical Science': 14,
  'Specialist Diploma in Consumer & Performance Analytics': 15,
  'Specialist Diploma in Consumer Banking': 3,
  'Specialist Diploma in Digital Branding & Social Media Strategies': 15,
  'Specialist Diploma in Early Childhood Learning Support': 24,
  'Specialist Diploma in Electrical Design & Operation': 5,
  'Specialist Diploma in IT Network Systems': 4,
  'Specialist Diploma in Palliative Care Nursing': 33,
  'Specialist Diploma in Sustainable Facilities Management': 23,
  'Specialist Diploma in Veterinary Clinical Practice': 24,
  'Upstream processing': 1},
 'school': {'Accounting & Finance': 'School of Business & Accountancy',
  'Advanced Diploma in Accountancy': 'School of Business & Accountancy',
  'Advanced Diploma in Early Childhood Intervention (Special Needs)': 'School of Humanities & Social Sciences',
  'Advanced Diploma in Early Childhood Leadership': 'School of Humanities & Social Sciences',
  'Advanced Diploma in Enterprise Business Analytics': 'School of InfoComm Technology',
  'Advanced Diploma in Medical and Pharmaceutical Technology': 'School of Life Sciences & Chemical Technology',
  'Advanced Diploma in Perioperative Nursing': 'School of Health Sciences',
  'Constructing a Meaningful Educational Setting': 'School of Humanities & Social Sciences',
  'Data Design & Analytics': 'School of Business & Accountancy',
  'Diploma (Conversion) in Digital Media Design': 'School of Film & Media Studies',
  'Diploma (Conversion) in Facility Management': 'School of Design & Environment',
  'Diploma (Conversion) in Marine & Offshore Technology': 'School of Engineering (Mechanical Engineering Division)',
  'Diploma in Accountancy': 'School of Business & Accountancy',
  'Diploma in Advertising & Public Relations': 'School of Film & Media Studies',
  'Diploma in Aerospace Electronics': 'School of Engineering',
  'Diploma in Aerospace Technology': 'School of Engineering',
  'Diploma in Animation & 3D Arts': 'School of InfoComm Technology',
  'Diploma in Arts Business Management': 'School of Humanities & Social Sciences',
  'Diploma in Audio-visual Technology': 'School of Engineering',
  'Diploma in Automation & Mechatronic Systems': 'School of Engineering',
  'Diploma in Banking & Financial Services': 'School of Business & Accountancy',
  'Diploma in Biomedical Engineering': 'School of Engineering',
  'Diploma in Biomedical Science': 'School of Life Sciences & Chemical Technology',
  'Diploma in Business & Social Enterprise': 'School of Humanities & Social Sciences',
  'Diploma in Business Information Technology': 'School of Business & Accountancy',
  'Diploma in Business Practice (Administration & Management)': 'School of Business & Accountancy',
  'Diploma in Business Practice (International Supply Chain Management)': 'School of Business & Accountancy',
  'Diploma in Business Practice (Tourism Management)': 'School of Business & Accountancy',
  'Diploma in Business Studies': 'School of Business & Accountancy',
  'Diploma in Chemical & Biomolecular Engineering': 'School of Life Sciences & Chemical Technology',
  'Diploma in Child Psychology & Early Education': 'School of Humanities & Social Sciences',
  'Diploma in Chinese Media & Communication': 'School of Humanities & Social Sciences',
  'Diploma in Chinese Studies': 'School of Humanities & Social Sciences',
  'Diploma in Clean Energy Management': 'School of Engineering',
  'Diploma in Early Childhood Care & Education - Teaching': 'School of Humanities & Social Sciences',
  'Diploma in Early Childhood Education': 'School of Humanities & Social Sciences',
  'Diploma in Electrical Engineering': 'School of Engineering',
  'Diploma in Electronic & Computer Engineering': 'School of Engineering',
  'Diploma in Engineering (Aerospace)': 'School of Engineering (Mechanical Engineering Division)',
  'Diploma in Engineering (Building Services & Fire Safety)': 'School of Design & Environment',
  'Diploma in Engineering (Electrical)': 'School of Engineering (Electrical Engineering Division)',
  'Diploma in Engineering (Electronics)': 'School of Engineering (Electronic & Computer Engineering Division)',
  'Diploma in Engineering (Marine)': 'School of Engineering (Mechanical Engineering Division)',
  'Diploma in Engineering (Mechanical)': 'School of Engineering (Mechanical Engineering Division)',
  'Diploma in Engineering (Mechatronics)': 'School of Engineering (Mechanical Engineering Division)',
  'Diploma in Engineering Science': 'School of Engineering',
  'Diploma in Engineering with Business Management Programme': 'School of Engineering',
  'Diploma in Environmental & Water Technology': 'School of Life Sciences & Chemical Technology',
  'Diploma in Film, Sound & Video': 'School of Film & Media Studies',
  'Diploma in Financial Informatics': 'School of InfoComm Technology',
  'Diploma in Health Sciences (Nursing)': 'School of Health Sciences',
  'Diploma in Hotel & Leisure Facilities Management': 'School of Design & Environment',
  'Diploma in Information Security & Forensics': 'School of InfoComm Technology',
  'Diploma in Information Technology': 'School of InfoComm Technology',
  'Diploma in International Business': 'School of Business & Accountancy',
  'Diploma in International Logistics & Supply Chain Management': 'School of Business & Accountancy',
  'Diploma in Landscape Design & Horticulture': 'School of Life Sciences & Chemical Technology',
  'Diploma in Marine & Offshore Technology': 'School of Engineering',

## Other things you could achieve

- Merge, join, and aggregate
- Reshaping and pivot tables
- Time series / date functionality
- Plotting with matplotlib
- IO tools (Text, CSV, etc)
- Group by: split-apply-combine